[{"id":"0.3877575877486221","order":"1","company":"Tesla","date":"August 2017 - December 2021","title":"Controls Engineer - Intern","description":"Created online dashboard using Python to track shear tests. Program grabs data from Tesla's manufacturing operating system and thread the queries to bring running time down from approximately ten minutes to ten seconds. Automated the dashboard so operator would only need to perform one action instead of multiple actions.\r\n\r\nSupported stator line by tracking faults in the program. Focused on narrowing in on possible causes within the code and implementing solutions.\r\n\r\nCreated new and modified existing HMI templates within ignition, often using Python for scripting and HTML for styling.\r\n\r\n"},{"id":"0.10713181700415308","order":"2","company":"TWG Technologies","date":"June 2020 - October 2020","title":"Software Engineer - Intern","description":"Team lead for the back-end using several technologies, such as Django, Python, JavaScript, HTML, and CSS to develop a tech support website.\r\n\r\nImplemented the backend for user authentication and messaging between user and support. Created page design for sign in, sign out, subscription, payment, and chat pages."},{"id":"0.6715410298736901","order":"3","company":"Utah Valley University","date":"January 2020 - August 2020","title":"CS Tutor - Part Time","description":"Worked closely with CS students to tutor in the key concepts of object- oriented programming. Analyzed and debugged python code and provided constructive feedback."},{"id":"0.5090866984384232","order":"4","company":"Intermountain Precision Casting","date":"October 2019 - May 2020","title":"Automation Engineer - Intern","description":"Utilized Rapid Programming, ABB six axis robots, Rockwell PLCs, and Raspberry Pi to improve quality processes for increased efficiency and effectiveness."},{"id":"0.8604060341638906","order":"5","company":"Advanced Industrial Products","date":"May 2019 - August 2019","title":"Application Engineer - Intern","description":"Programmed Omron collaborative robots to improve client's manufacturing operations by increasing consistency and decreasing waste."},{"id":"0.7094770383176703","order":"6","company":"Lashbrook","date":"May 2017 - August 2019","title":"CNC Machinist - Full Time","description":"Provided job training and monitored performance of team members while operating and maintaining up to 5 different mill and lathe machines to fabricate wedding rings."}]